Тест_ЗУП_31_КОРП/src/AccumulationRegisters/ВзаиморасчетыССотрудниками/ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидВзаиморасчетов</name>
    <type>
      <types>EnumRef.ВидыВзаиморасчетовССотрудниками</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНачисленияУдержанияВыплаты</name>
    <type>
      <types>EnumRef.ГруппыНачисленияУдержанияВыплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест_ЗУП_31_КОРП/src/Documents/ДепонированиеЗарплаты/ДепонированиеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДепонированиеЗарплаты</name>
  <basedOn>Document.ВедомостьНаВыплатуЗарплатыВКассу</basedOn>
  <basedOn>Document.ВедомостьНаВыплатуЗарплатыРаздатчиком</basedOn>
  <registerRecords>AccumulationRegister.РасчетыНалогоплательщиковСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.УплатаНДФЛНалоговымиАгентамиКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.БухгалтерскиеВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСДепонентами</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.СведенияОДоходахНДФЛ</registerRecords>
  <registerRecords>InformationRegister.ОплатаВедомостейНаВыплатуЗарплаты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ведомость</name>
    <type>
      <types>DocumentRef.ВедомостьНаВыплатуЗарплатыРаздатчиком</types>
      <types>DocumentRef.ВедомостьНаВыплатуЗарплатыВКассу</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Бухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Депоненты</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/CommonModules/УчетДепонированнойЗарплатыРасширенный/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииДокументаДепонированиеЗарплаты

/// Обработчики событий модуля объекта документов Депонирование зарплаты.

Процедура ДепонированиеЗарплатыОбработкаПроведения(ДокументОбъект, Отказ) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		
		Ведомость	= ДокументОбъект.Ведомость; 
		Физлица		= ДокументОбъект.Депоненты.ВыгрузитьКолонку("ФизическоеЛицо");
		 
		// проверка на единственность документа депонирования по ведомости
		ДепонированияПоВедомости = Документы.ДепонированиеЗарплаты.ВыбратьПоВедомости(Ведомость, Истина);
		Если ДепонированияПоВедомости.Количество() <> 0 
			И (ДепонированияПоВедомости.Количество() > 1 ИЛИ ДепонированияПоВедомости[0] <> ДокументОбъект.Ссылка) Тогда
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По документу %1 уже введены сведения о депонированной зарплате.'"), Ведомость);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, ДокументОбъект, "Ведомость");
			Отказ = Истина;
		КонецЕсли;	
		
		// проверка на соответствие документа депонирования ведомости
		ОплатаВедомостей = ДокументОбъект.Депоненты.Выгрузить(, "ФизическоеЛицо");
		ОплатаВедомостей.Колонки.Добавить("Ведомость", Метаданные.Документы.ДепонированиеЗарплаты.Реквизиты.Ведомость.Тип);
		ОплатаВедомостей.ЗаполнитьЗначения(Ведомость, "Ведомость");
		
		Проверки = ВзаиморасчетыССотрудниками.ПроверкиОплатыВедомостейДокументом();
		Проверки.Удалить("ПовторнаяВыплата");
		ВзаиморасчетыССотрудниками.ПроверитьОплатуВедомостейДокументом(ДокументОбъект.Ссылка, Отказ, ОплатаВедомостей);
		
		// регистрация депонированных сумм
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ведомость",	Ведомость);
		Запрос.УстановитьПараметр("Физлица", 	Физлица);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудниками.Организация,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов,
		|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
		|ГДЕ
		|	ВзаиморасчетыССотрудниками.Регистратор = &Ведомость
		|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В(&Физлица)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыССотрудниками.Организация,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов";
		
		ВыборкаПоВедомости = Запрос.Выполнить().Выбрать();
		
		ДепонируемаяЗарплата = УчетДепонированнойЗарплаты.НоваяТаблицаДепонированнойЗарплаты();
		Пока ВыборкаПоВедомости.Следующий() Цикл
			СтрокаДепонируемойЗарплаты = ДепонируемаяЗарплата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДепонируемойЗарплаты, ВыборкаПоВедомости);
		КонецЦикла;	
		ДепонируемаяЗарплата.ЗаполнитьЗначения(Ведомость, "Ведомость");
		ДепонируемаяЗарплата.ЗаполнитьЗначения(ДокументОбъект.Дата, "Дата");
		
		ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ДокументОбъект);
		УчетДепонированнойЗарплаты.ЗарегистрироватьДепонированнуюЗарплату(ДокументОбъект.Движения, Отказ, ДепонируемаяЗарплата, Истина);
		
	Иначе
		УчетДепонированнойЗарплатыБазовый.ДепонированиеЗарплатыОбработкаПроведения(ДокументОбъект, Отказ)
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	// Подчинение вариантов отчета функциональной опции РаботаВХозрасчетнойОрганизации.
	ФункциональныеОпции = Новый Массив;
	ФункциональныеОпции.Добавить("РаботаВХозрасчетнойОрганизации");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КнигаУчетаДепонентов, "КнигаУчетаДепонентов");
	Вариант.ФункциональныеОпции = ФункциональныеОпции;
	
	
	// Подчинение вариантов отчета функциональной опции РаботаВБюджетномУчреждении.
	ФункциональныеОпции = Новый Массив;
	ФункциональныеОпции.Добавить("РаботаВБюджетномУчреждении");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КнигаУчетаДепонентов, "Форма0504048");
	Вариант.ФункциональныеОпции = ФункциональныеОпции;
	Вариант.Включен = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Возвращает описание команды печати реестра депонированных сумм.
// 
// Возвращаемое значение:
//   Структура - структура с полями:
//		* ПредставлениеКоманды - строка.
//
Функция ОписаниеПечатиРеестраДепонированныхСумм() Экспорт
	
	ОписаниеПечатиРеестраДепонированныхСумм = УчетДепонированнойЗарплатыБазовый.ОписаниеПечатиРеестраДепонированныхСумм();
	
	Если ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
		ОписаниеПечатиРеестраДепонированныхСумм.ПредставлениеКоманды= НСтр("ru = 'Печать реестра депонированных сумм (ф.0504047)'");
		ОписаниеПечатиРеестраДепонированныхСумм.ИмяМакета			= "Документ.ДепонированиеЗарплаты.ПФ_MXL_РеестрДепонированныхСумм0504047";
		ОписаниеПечатиРеестраДепонированныхСумм.СинонимМакета		= НСтр("ru = 'Реестр депонированных сумм (0504047)'");
	КонецЕсли;	
	
	Возврат ОписаниеПечатиРеестраДепонированныхСумм
	
КонецФункции

Процедура ПриКомпоновкеОтчетаКнигаУчетаДепонентов(Объект, ДокументРезультат, СтандартнаяОбработка) Экспорт
	
	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(Объект.КомпоновщикНастроек);
	Если КлючВарианта = "КнигаУчетаДепонентов" Тогда		
		УчетДепонированнойЗарплатыБазовый.ПриКомпоновкеОтчетаКнигаУчетаДепонентов(Объект, ДокументРезультат, СтандартнаяОбработка);		
	Иначе
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("ОтчетыПечатныеФормыБюджетныхУчреждений");
			Модуль.ПриКомпоновкеОтчетаКнигаУчетаДепонентов(Объект, ДокументРезультат, СтандартнаяОбработка, КлючВарианта);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
